#### Terraform Plan 📋 `stage/argocd`

**Summary:** 20:03:25.743 STDOUT terraform: Plan: 5 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
20:03:25.742 STDOUT terraform:       + force_update               = false
20:03:25.742 STDOUT terraform:       + id                         = (known after apply)
20:03:25.742 STDOUT terraform:       + lint                       = false
20:03:25.742 STDOUT terraform:       + max_history                = 0
20:03:25.742 STDOUT terraform:       + metadata                   = (known after apply)
20:03:25.742 STDOUT terraform:       + name                       = "argocd-apps"
20:03:25.742 STDOUT terraform:       + namespace                  = "argocd"
20:03:25.742 STDOUT terraform:       + pass_credentials           = false
20:03:25.742 STDOUT terraform:       + recreate_pods              = false
20:03:25.742 STDOUT terraform:       + render_subchart_notes      = true
20:03:25.742 STDOUT terraform:       + replace                    = false
20:03:25.742 STDOUT terraform:       + repository                 = "https://argoproj.github.io/argo-helm"
20:03:25.742 STDOUT terraform:       + reset_values               = false
20:03:25.742 STDOUT terraform:       + reuse_values               = false
20:03:25.742 STDOUT terraform:       + set_wo                     = (write-only attribute)
20:03:25.742 STDOUT terraform:       + skip_crds                  = false
20:03:25.742 STDOUT terraform:       + status                     = "deployed"
20:03:25.742 STDOUT terraform:       + take_ownership             = false
20:03:25.742 STDOUT terraform:       + timeout                    = 300
20:03:25.742 STDOUT terraform:       + upgrade_install            = false
20:03:25.742 STDOUT terraform:       + values                     = [
20:03:25.742 STDOUT terraform:           + <<-EOT
20:03:25.742 STDOUT terraform:                 "applications":
20:03:25.742 STDOUT terraform:                   "root-app":
20:03:25.742 STDOUT terraform:                     "destination":
20:03:25.742 STDOUT terraform:                       "namespace": "argocd"
20:03:25.742 STDOUT terraform:                       "server": "https://kubernetes.default.svc"
20:03:25.742 STDOUT terraform:                     "finalizers":
20:03:25.742 STDOUT terraform:                     - "resources-finalizer.argocd.argoproj.io"
20:03:25.742 STDOUT terraform:                     "project": "default"
20:03:25.742 STDOUT terraform:                     "source":
20:03:25.742 STDOUT terraform:                       "path": "gitops/apps/stage"
20:03:25.742 STDOUT terraform:                       "repoURL": "https://github.com/krukmaksym/my-devops-project-infra"
20:03:25.742 STDOUT terraform:                       "targetRevision": "main"
20:03:25.742 STDOUT terraform:                     "syncPolicy":
20:03:25.742 STDOUT terraform:                       "automated":
20:03:25.742 STDOUT terraform:                         "prune": true
20:03:25.742 STDOUT terraform:                         "selfHeal": true
20:03:25.742 STDOUT terraform:             EOT,
20:03:25.742 STDOUT terraform:         ]
20:03:25.742 STDOUT terraform:       + verify                     = false
20:03:25.742 STDOUT terraform:       + version                    = "2.0.2"
20:03:25.742 STDOUT terraform:       + wait                       = true
20:03:25.742 STDOUT terraform:       + wait_for_jobs              = false
20:03:25.742 STDOUT terraform:     }
20:03:25.742 STDOUT terraform:   # kubernetes_namespace_v1.argocd will be created
20:03:25.742 STDOUT terraform:   + resource "kubernetes_namespace_v1" "argocd" {
20:03:25.742 STDOUT terraform:       + id                               = (known after apply)
20:03:25.742 STDOUT terraform:       + wait_for_default_service_account = false
20:03:25.742 STDOUT terraform:       + metadata {
20:03:25.742 STDOUT terraform:           + generation       = (known after apply)
20:03:25.742 STDOUT terraform:           + labels           = {
20:03:25.742 STDOUT terraform:               + "name" = "argocd"
20:03:25.742 STDOUT terraform:             }
20:03:25.742 STDOUT terraform:           + name             = "argocd"
20:03:25.742 STDOUT terraform:           + resource_version = (known after apply)
20:03:25.742 STDOUT terraform:           + uid              = (known after apply)
20:03:25.742 STDOUT terraform:         }
20:03:25.742 STDOUT terraform:     }
20:03:25.742 STDOUT terraform:   # kubernetes_secret_v1.argocd_redis will be created
20:03:25.743 STDOUT terraform:   + resource "kubernetes_secret_v1" "argocd_redis" {
20:03:25.743 STDOUT terraform:       + binary_data_wo                 = (write-only attribute)
20:03:25.743 STDOUT terraform:       + data                           = (sensitive value)
20:03:25.743 STDOUT terraform:       + data_wo                        = (write-only attribute)
20:03:25.743 STDOUT terraform:       + id                             = (known after apply)
20:03:25.743 STDOUT terraform:       + type                           = "Opaque"
20:03:25.743 STDOUT terraform:       + wait_for_service_account_token = true
20:03:25.743 STDOUT terraform:       + metadata {
20:03:25.743 STDOUT terraform:           + generation       = (known after apply)
20:03:25.743 STDOUT terraform:           + name             = "argocd-redis"
20:03:25.743 STDOUT terraform:           + namespace        = "argocd"
20:03:25.743 STDOUT terraform:           + resource_version = (known after apply)
20:03:25.743 STDOUT terraform:           + uid              = (known after apply)
20:03:25.743 STDOUT terraform:         }
20:03:25.743 STDOUT terraform:     }
20:03:25.743 STDOUT terraform:   # random_password.redis will be created
20:03:25.743 STDOUT terraform:   + resource "random_password" "redis" {
20:03:25.743 STDOUT terraform:       + bcrypt_hash = (sensitive value)
20:03:25.743 STDOUT terraform:       + id          = (known after apply)
20:03:25.743 STDOUT terraform:       + length      = 16
20:03:25.743 STDOUT terraform:       + lower       = true
20:03:25.743 STDOUT terraform:       + min_lower   = 0
20:03:25.743 STDOUT terraform:       + min_numeric = 0
20:03:25.743 STDOUT terraform:       + min_special = 0
20:03:25.743 STDOUT terraform:       + min_upper   = 0
20:03:25.743 STDOUT terraform:       + number      = true
20:03:25.743 STDOUT terraform:       + numeric     = true
20:03:25.743 STDOUT terraform:       + result      = (sensitive value)
20:03:25.743 STDOUT terraform:       + special     = false
20:03:25.743 STDOUT terraform:       + upper       = true
20:03:25.743 STDOUT terraform:     }
20:03:25.743 STDOUT terraform: Plan: 5 to add, 0 to change, 0 to destroy.
20:03:25.743 STDOUT terraform: Changes to Outputs:
20:03:25.743 STDOUT terraform:   + helm_release_name   = "argocd"
20:03:25.743 STDOUT terraform:   + helm_release_status = "deployed"
20:03:25.743 STDOUT terraform:   + namespace           = "argocd"
20:03:25.809 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
20:03:25.809 STDOUT terraform: Saved the plan to: tfplan
20:03:25.809 STDOUT terraform: To perform exactly these actions, run the following command to apply:
20:03:25.809 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*